emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    clocktree.h
 * @brief   Generated clock tree description header.
 *
 * @addtogroup CLOCKTREE
 * @{
 */
#ifndef CLOCKTREE_H
#define CLOCKTREE_H

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Dynamic clock point indexes and names
 * @{
 */
#define CLK_HSI16               0U
#define CLK_HSI48               1U
#define CLK_HSE                 2U
#define CLK_PLLP                3U
#define CLK_PLLQ                4U
#define CLK_PLLR                5U
#define CLK_SYSCLK              6U
#define CLK_HCLK                7U
#define CLK_PCLK1               8U
#define CLK_PCLK2               9U
#define CLK_PCLK1TIM            10U
#define CLK_PCLK2TIM            11U
#define CLK_MCO                 12U
#define CLK_ARRAY_SIZE          13U

#define CLK_POINT_NAMES                                                     \
  {                                                                         \
    "HSI16",                                                                \
    "HSI48",                                                                \
    "HSE",                                                                  \
    "PLLP",                                                                 \
    "PLLQ",                                                                 \
    "PLLR",                                                                 \
    "SYSCLK",                                                               \
    "HCLK",                                                                 \
    "PCLK1",                                                                \
    "PCLK2",                                                                \
    "PCLK1TIM",                                                             \
    "PCLK2TIM",                                                             \
    "MCO"                                                                   \
  }
/** @} */

/**
 * @name    Generated support definitions
 * @{
 */
#define STM32_CLOCK_DISABLED                0U
#define STM32_CLOCK_AUTO                    1U
#define STM32_CLOCK_ENABLED                 2U

#define PWR_CR1_VOS_RANGE1                  ((1U) << PWR_CR1_VOS_Pos)
#define PWR_CR1_VOS_RANGE2                  ((2U) << PWR_CR1_VOS_Pos)
#define RCC_PLLCFGR_PLLSRC_NOCLOCK          0U
#define RCC_BDCR_LSCOSEL_NOCLOCK            0U
#define RCC_BDCR_LSCOSEL_LSI                RCC_BDCR_LSCOEN
#define RCC_BDCR_LSCOSEL_LSE                (RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL)
/** @} */

/**
 * @name    Generated mux selector constants
 * @{
 */
#define RCC_CFGR_MCOSEL_NOCLOCK             ((0U) << 24U)
#define RCC_CFGR_MCOSEL_SYSCLK              ((1U) << 24U)
#define RCC_CFGR_MCOSEL_HSI16               ((3U) << 24U)
#define RCC_CFGR_MCOSEL_HSE                 ((4U) << 24U)
#define RCC_CFGR_MCOSEL_PLLRCLK             ((5U) << 24U)
#define RCC_CFGR_MCOSEL_LSI                 ((6U) << 24U)
#define RCC_CFGR_MCOSEL_LSE                 ((7U) << 24U)
#define RCC_CFGR_MCOSEL_HSI48               ((8U) << 24U)

#define RCC_BDCR_RTCSEL_NOCLOCK             ((0U) << 8U)
#define RCC_BDCR_RTCSEL_LSE                 ((1U) << 8U)
#define RCC_BDCR_RTCSEL_LSI                 ((2U) << 8U)
#define RCC_BDCR_RTCSEL_HSEDIV              ((3U) << 8U)

#define RCC_CCIPR_USART1SEL_PCLK2           ((0U) << 0U)
#define RCC_CCIPR_USART1SEL_SYSCLK          ((1U) << 0U)
#define RCC_CCIPR_USART1SEL_HSI16           ((2U) << 0U)
#define RCC_CCIPR_USART1SEL_LSE             ((3U) << 0U)

#define RCC_CCIPR_USART2SEL_PCLK1           ((0U) << 2U)
#define RCC_CCIPR_USART2SEL_SYSCLK          ((1U) << 2U)
#define RCC_CCIPR_USART2SEL_HSI16           ((2U) << 2U)
#define RCC_CCIPR_USART2SEL_LSE             ((3U) << 2U)

#define RCC_CCIPR_USART3SEL_PCLK1           ((0U) << 4U)
#define RCC_CCIPR_USART3SEL_SYSCLK          ((1U) << 4U)
#define RCC_CCIPR_USART3SEL_HSI16           ((2U) << 4U)
#define RCC_CCIPR_USART3SEL_LSE             ((3U) << 4U)

#define RCC_CCIPR_UART4SEL_PCLK1            ((0U) << 6U)
#define RCC_CCIPR_UART4SEL_SYSCLK           ((1U) << 6U)
#define RCC_CCIPR_UART4SEL_HSI16            ((2U) << 6U)
#define RCC_CCIPR_UART4SEL_LSE              ((3U) << 6U)

#define RCC_CCIPR_UART5SEL_PCLK1            ((0U) << 8U)
#define RCC_CCIPR_UART5SEL_SYSCLK           ((1U) << 8U)
#define RCC_CCIPR_UART5SEL_HSI16            ((2U) << 8U)
#define RCC_CCIPR_UART5SEL_LSE              ((3U) << 8U)

#define RCC_CCIPR_LPUART1SEL_PCLK1          ((0U) << 10U)
#define RCC_CCIPR_LPUART1SEL_SYSCLK         ((1U) << 10U)
#define RCC_CCIPR_LPUART1SEL_HSI16          ((2U) << 10U)
#define RCC_CCIPR_LPUART1SEL_LSE            ((3U) << 10U)

#define RCC_CCIPR_I2C1SEL_PCLK1             ((0U) << 12U)
#define RCC_CCIPR_I2C1SEL_SYSCLK            ((1U) << 12U)
#define RCC_CCIPR_I2C1SEL_HSI16             ((2U) << 12U)

#define RCC_CCIPR_I2C2SEL_PCLK1             ((0U) << 14U)
#define RCC_CCIPR_I2C2SEL_SYSCLK            ((1U) << 14U)
#define RCC_CCIPR_I2C2SEL_HSI16             ((2U) << 14U)

#define RCC_CCIPR_I2C3SEL_PCLK1             ((0U) << 16U)
#define RCC_CCIPR_I2C3SEL_SYSCLK            ((1U) << 16U)
#define RCC_CCIPR_I2C3SEL_HSI16             ((2U) << 16U)

