emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
#if !((STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART4_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART5_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPUART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C4_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2S23_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_I2S23_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_I2S23_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2S23_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_FDCAN_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_FDCAN_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_FDCAN_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_FDCAN_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADC12_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_ADC12_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_ADC12_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADC12_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADC345_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_ADC345_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_ADC345_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADC345_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_QSPI_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_QSPI_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_QSPI_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_QSPI_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_RNG_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USB_CLOCK_MODE value specified"
#endif

