emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
#if !((STM32_CFG_PLLP_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_PLLP_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLLP clock disabled but PLLP clock is required"
#endif

#if !((STM32_CFG_PLLQ_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_PLLQ_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLLQ clock disabled but PLLQ clock is required"
#endif

#if !((STM32_CFG_PLLR_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_PLLR_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLLR clock disabled but PLLR clock is required"
#endif

#if !((STM32_CFG_RTC_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_RTC_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "RTC clock disabled but RTC clock is required"
#endif

#if !((STM32_CFG_USART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART1 clock disabled but USART1 clock is required"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART2 clock disabled but USART2 clock is required"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART3 clock disabled but USART3 clock is required"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART4 clock disabled but UART4 clock is required"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART5_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART5 clock disabled but UART5 clock is required"
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_LPUART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPUART1 clock disabled but LPUART1 clock is required"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C1 clock disabled but I2C1 clock is required"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C2 clock disabled but I2C2 clock is required"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C3 clock disabled but I2C3 clock is required"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C4 clock disabled but I2C4 clock is required"
#endif

#if !((STM32_CFG_LPTIM1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_LPTIM1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPTIM1 clock disabled but LPTIM1 clock is required"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SAI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SAI1 clock disabled but SAI1 clock is required"
#endif

#if !((STM32_CFG_I2S23_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_I2S23_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2S23 clock disabled but I2S23 clock is required"
#endif

#if !((STM32_CFG_FDCAN_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_FDCAN_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "FDCAN clock disabled but FDCAN clock is required"
#endif

#if !((STM32_CFG_ADC12_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_ADC12_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "ADC12 clock disabled but ADC12 clock is required"
#endif

#if !((STM32_CFG_ADC345_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_ADC345_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "ADC345 clock disabled but ADC345 clock is required"
#endif

#if !((STM32_CFG_QSPI_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_QSPI_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "QSPI clock disabled but QSPI clock is required"
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_RNG_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "RNG clock disabled but RNG clock is required"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_USB_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USB clock disabled but USB clock is required"
#endif

/**
 * @name    Frequency limits for boost state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_BOOST_HSECLK_MIN              8000000
#define STM32_BOOST_HSECLK_MAX              48000000
#else
#define STM32_BOOST_HSECLK_MIN              8000000
#define STM32_BOOST_HSECLK_MAX              48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_BOOST_LSECLK_MIN              32768
#define STM32_BOOST_LSECLK_MAX              1000000
#else
#define STM32_BOOST_LSECLK_MIN              32768
#define STM32_BOOST_LSECLK_MAX              32768
#endif
#define STM32_BOOST_PLLIN_MIN               2660000
#define STM32_BOOST_PLLIN_MAX               16000000
#define STM32_BOOST_PLLVCO_MIN              96000000
#define STM32_BOOST_PLLVCO_MAX              344000000
#define STM32_BOOST_PLLP_MIN                2064500
#define STM32_BOOST_PLLP_MAX                170000000
#define STM32_BOOST_PLLQ_MIN                8000000
#define STM32_BOOST_PLLQ_MAX                170000000
#define STM32_BOOST_PLLR_MIN                8000000
#define STM32_BOOST_PLLR_MAX                170000000
#define STM32_BOOST_SYSCLK_MAX              170000000
#define STM32_BOOST_HCLK_MAX                170000000
#define STM32_BOOST_PCLK1_MAX               170000000
#define STM32_BOOST_PCLK2_MAX               170000000
#define STM32_BOOST_ADCCLK_MAX              60000000
#define STM32_BOOST_USBCLK_MIN              47880000
#define STM32_BOOST_USBCLK_MAX              48120000
#define STM32_BOOST_FLASH_0WS_MAX           34000000
#define STM32_BOOST_FLASH_1WS_MAX           68000000
#define STM32_BOOST_FLASH_2WS_MAX           102000000
#define STM32_BOOST_FLASH_3WS_MAX           136000000
#define STM32_BOOST_FLASH_4WS_MAX           170000000
/** @} */

/**
 * @name    Frequency limits for vos1 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_HSECLK_MIN               8000000
#define STM32_VOS1_HSECLK_MAX               48000000
#else
#define STM32_VOS1_HSECLK_MIN               8000000
#define STM32_VOS1_HSECLK_MAX               48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               1000000
#else
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               32768
#endif
#define STM32_VOS1_PLLIN_MIN                2660000
#define STM32_VOS1_PLLIN_MAX                16000000
#define STM32_VOS1_PLLVCO_MIN               96000000
#define STM32_VOS1_PLLVCO_MAX               344000000
#define STM32_VOS1_PLLP_MIN                 2064500
#define STM32_VOS1_PLLP_MAX                 150000000
#define STM32_VOS1_PLLQ_MIN                 8000000
#define STM32_VOS1_PLLQ_MAX                 150000000
#define STM32_VOS1_PLLR_MIN                 8000000
#define STM32_VOS1_PLLR_MAX                 150000000
#define STM32_VOS1_SYSCLK_MAX               150000000
#define STM32_VOS1_HCLK_MAX                 150000000
#define STM32_VOS1_PCLK1_MAX                150000000
#define STM32_VOS1_PCLK2_MAX                150000000
#define STM32_VOS1_ADCCLK_MAX               60000000
#define STM32_VOS1_USBCLK_MIN               47880000
#define STM32_VOS1_USBCLK_MAX               48120000
#define STM32_VOS1_FLASH_0WS_MAX            30000000
#define STM32_VOS1_FLASH_1WS_MAX            60000000
#define STM32_VOS1_FLASH_2WS_MAX            90000000
#define STM32_VOS1_FLASH_3WS_MAX            120000000
#define STM32_VOS1_FLASH_4WS_MAX            150000000
/** @} */

/**
 * @name    Frequency limits for vos2 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_HSECLK_MIN               8000000
#define STM32_VOS2_HSECLK_MAX               26000000
#else
#define STM32_VOS2_HSECLK_MIN               8000000
#define STM32_VOS2_HSECLK_MAX               26000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               1000000
#else
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               32768
#endif
#define STM32_VOS2_PLLIN_MIN                2660000
#define STM32_VOS2_PLLIN_MAX                16000000
#define STM32_VOS2_PLLVCO_MIN               96000000
#define STM32_VOS2_PLLVCO_MAX               128000000
#define STM32_VOS2_PLLP_MIN                 2064500
#define STM32_VOS2_PLLP_MAX                 26000000
#define STM32_VOS2_PLLQ_MIN                 8000000
#define STM32_VOS2_PLLQ_MAX                 26000000
#define STM32_VOS2_PLLR_MIN                 8000000
#define STM32_VOS2_PLLR_MAX                 26000000
#define STM32_VOS2_SYSCLK_MAX               26000000
#define STM32_VOS2_HCLK_MAX                 26000000
#define STM32_VOS2_PCLK1_MAX                26000000
#define STM32_VOS2_PCLK2_MAX                26000000
#define STM32_VOS2_ADCCLK_MAX               26000000
#define STM32_VOS2_USBCLK_MIN               47880000
#define STM32_VOS2_USBCLK_MAX               48120000
#define STM32_VOS2_FLASH_0WS_MAX            12000000
#define STM32_VOS2_FLASH_1WS_MAX            24000000
#define STM32_VOS2_FLASH_2WS_MAX            26000000
#define STM32_VOS2_FLASH_3WS_MAX            0
#define STM32_VOS2_FLASH_4WS_MAX            0
/** @} */

