emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
#if !((STM32_HSE_ENABLED != TRUE) || (STM32_HSE_FREQ <= STM32_HSECLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HSE_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the LSE clock point. --------------------------*/

#if !((STM32_CFG_LSE_ENABLE == TRUE) || (STM32_CFG_LSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSE_ENABLE value specified"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&    \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by MCODIV"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LSCO_ENABLED == TRUE) &&      \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LSCO"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_RTC_ENABLED == TRUE) &&       \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by RTC"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_USART1_ENABLED == TRUE) &&    \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by USART1"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_USART2_ENABLED == TRUE) &&    \
      (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by USART2"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_USART3_ENABLED == TRUE) &&    \
      (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by USART3"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_UART4_ENABLED == TRUE) &&     \
      (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by UART4"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_UART5_ENABLED == TRUE) &&     \
      (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by UART5"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPUART1_ENABLED == TRUE) &&   \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_LSE))) &&              \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPUART1"
#endif

#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPTIM1"
#endif

/**
 * @brief   LSE nominal source frequency.
 */
#define STM32_LSE_SOURCE_FREQ               STM32_LSECLK

/**
 * @brief   LSE clock register bits.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_BITS                    RCC_BDCR_LSEON
#else
  #define STM32_LSE_BITS                    0U
#endif

/**
 * @brief   Low frequency external oscillator clock point.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_FREQ                    STM32_LSE_SOURCE_FREQ
  #define STM32_LSE_CLOCK                   STM32_LSE_SOURCE_FREQ
#else
  #define STM32_LSE_FREQ                    0U
  #define STM32_LSE_CLOCK                   0U
#endif

#if !((STM32_LSE_ENABLED != TRUE) || (STM32_LSE_FREQ >= STM32_LSECLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_LSE_FREQ below minimum frequency"
#endif

#if !((STM32_LSE_ENABLED != TRUE) || (STM32_LSE_FREQ <= STM32_LSECLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_LSE_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the LSI clock point. --------------------------*/

#if !((STM32_CFG_LSI_ENABLE == TRUE) || (STM32_CFG_LSI_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSI_ENABLE value specified"
#endif

#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&    \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by MCODIV"
#endif

#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LSCO_ENABLED == TRUE) &&      \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LSCO"
#endif

#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_RTC_ENABLED == TRUE) &&       \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by RTC"
#endif

#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LPTIM1"
#endif

/**
 * @brief   LSI nominal source frequency.
 */
#define STM32_LSI_SOURCE_FREQ               32000U

/**
 * @brief   LSI clock register bits.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_BITS                    RCC_CSR_LSION
#else
  #define STM32_LSI_BITS                    0U
#endif

/**
 * @brief   Low frequency internal oscillator clock point.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_FREQ                    STM32_LSI_SOURCE_FREQ
  #define STM32_LSI_CLOCK                   STM32_LSI_SOURCE_FREQ
#else
  #define STM32_LSI_FREQ                    0U
  #define STM32_LSI_CLOCK                   0U
#endif

/* --- Macros and checks for the CKIN clock point. -------------------------*/

/**
 * @brief   CKIN nominal source frequency.
 */
#define STM32_CKIN_SOURCE_FREQ              0U

/**
 * @brief   CKIN clock register bits.
 */
#define STM32_CKIN_BITS                     0U

/**
 * @brief   External audio clock input clock point.
 */
#define STM32_CKIN_FREQ                     STM32_CKIN_SOURCE_FREQ
#define STM32_CKIN_CLOCK                    STM32_CKIN_SOURCE_FREQ

/* --- Macros and checks for the PLLIN clock point. ------------------------*/

/**
 * @brief   PLLIN clock register bits.
 */
#if (STM32_PLLIN_ENABLED == FALSE)
  #define STM32_PLLIN_BITS                  RCC_PLLCFGR_PLLSRC_NOCLOCK
#elif (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_NOCLOCK) ||                \
      defined(__DOXYGEN__)
  #if (STM32_PLLIN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLLIN_BITS                RCC_PLLCFGR_PLLSRC_NOCLOCK
  #else
    #define STM32_PLLIN_BITS                0U
  #endif
#elif (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSI)
  #if (STM32_PLLIN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLLIN_BITS                RCC_PLLCFGR_PLLSRC_HSI
  #else
    #define STM32_PLLIN_BITS                0U
  #endif
#elif (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSE)
  #if (STM32_PLLIN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLLIN_BITS                RCC_PLLCFGR_PLLSRC_HSE
  #else
    #define STM32_PLLIN_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PLLIN_SEL value specified"
#endif

/**
 * @brief   PLL input clock point.
 */
#if ((STM32_PLLIN_ENABLED == TRUE) && \
     (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_PLLIN_FREQ                  STM32_NONE_FREQ
  #define STM32_PLLIN_CLOCK                 STM32_NONE_CLOCK
#elif (STM32_PLLIN_ENABLED == TRUE) && \
      (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSI)
  #define STM32_PLLIN_FREQ                  STM32_HSI16_FREQ
  #define STM32_PLLIN_CLOCK                 STM32_HSI16_CLOCK
#elif (STM32_PLLIN_ENABLED == TRUE) && \
      (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSE)
  #define STM32_PLLIN_FREQ                  STM32_HSE_FREQ
  #define STM32_PLLIN_CLOCK                 STM32_HSE_CLOCK
#else
  #define STM32_PLLIN_FREQ                  0U
  #define STM32_PLLIN_CLOCK                 0U
#endif

/* --- Macros and checks for the PLLREF clock point. -----------------------*/

#if !((STM32_CFG_PLLREF_VALUE >= 1) && (STM32_CFG_PLLREF_VALUE <= 16)) &&   \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLLREF_VALUE value specified"
#endif

/**
 * @brief   PLLREF clock register bits.
 */
#if (STM32_PLLREF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLREF_BITS                 ((STM32_CFG_PLLREF_VALUE -      \
                                              1U) << RCC_PLLCFGR_PLLM_Pos)
#else
  #define STM32_PLLREF_BITS                 0U
#endif

/**
 * @brief   PLL reference clock point.
 */
#if (STM32_PLLREF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLREF_FREQ                 (STM32_PLLIN_FREQ /             \
                                             STM32_CFG_PLLREF_VALUE)
  #define STM32_PLLREF_CLOCK                (STM32_PLLIN_CLOCK /            \
                                             STM32_CFG_PLLREF_VALUE)
#else
  #define STM32_PLLREF_FREQ                 0U
  #define STM32_PLLREF_CLOCK                0U
#endif

#if !((STM32_PLLREF_ENABLED != TRUE) || (STM32_PLLREF_FREQ >= STM32_PLLIN_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLREF_FREQ below minimum frequency"
#endif

#if !((STM32_PLLREF_ENABLED != TRUE) || (STM32_PLLREF_FREQ <= STM32_PLLIN_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLREF_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLLVCO clock point. -----------------------*/

#if !((STM32_CFG_PLLVCO_VALUE >= 8) && (STM32_CFG_PLLVCO_VALUE <= 127)) &&  \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLLVCO_VALUE value specified"
#endif

/**
 * @brief   PLLVCO clock register bits.
 */
#if (STM32_PLLVCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLVCO_BITS                 (STM32_CFG_PLLVCO_VALUE << RCC_PLLCFGR_PLLN_Pos)
#else
  #define STM32_PLLVCO_BITS                 0U
#endif

/**
 * @brief   PLL VCO clock point.
 */
#if (STM32_PLLVCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLVCO_FREQ                 (STM32_PLLREF_FREQ *            \
                                             STM32_CFG_PLLVCO_VALUE)
  #define STM32_PLLVCO_CLOCK                (STM32_PLLREF_CLOCK *           \
                                             STM32_CFG_PLLVCO_VALUE)
#else
  #define STM32_PLLVCO_FREQ                 0U
  #define STM32_PLLVCO_CLOCK                0U
#endif

