emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
#if !((STM32_PLLVCO_ENABLED != TRUE) ||                                     \
     (STM32_PLLVCO_FREQ >= STM32_PLLVCO_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLLVCO_FREQ below minimum frequency"
#endif

#if !((STM32_PLLVCO_ENABLED != TRUE) ||                                     \
     (STM32_PLLVCO_FREQ <= STM32_PLLVCO_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLLVCO_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLLP clock point. -------------------------*/

#if !((STM32_CFG_PLLP_VALUE >= 2) && (STM32_CFG_PLLP_VALUE <= 31)) &&       \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLLP_VALUE value specified"
#endif

/**
 * @brief   PLLP clock register bits.
 */
#if (STM32_PLLP_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLP_BITS                   (RCC_PLLCFGR_PLLPEN |           \
                                             (STM32_CFG_PLLP_VALUE << RCC_PLLCFGR_PLLPDIV_Pos))
#else
  #define STM32_PLLP_BITS                   0U
#endif

/**
 * @brief   PLL P output clock point.
 */
#if (STM32_PLLP_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLP_FREQ                   (STM32_PLLVCO_FREQ /            \
                                             STM32_CFG_PLLP_VALUE)
#else
  #define STM32_PLLP_FREQ                   0U
#endif
#define STM32_PLLP_CLOCK                    hal_lld_get_clock_point(CLK_PLLP)

#if !((STM32_PLLP_ENABLED != TRUE) || (STM32_PLLP_FREQ >= STM32_PLLP_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLP_FREQ below minimum frequency"
#endif

#if !((STM32_PLLP_ENABLED != TRUE) || (STM32_PLLP_FREQ <= STM32_PLLP_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLP_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLLQ clock point. -------------------------*/

#if !((STM32_CFG_PLLQ_VALUE == 2) || (STM32_CFG_PLLQ_VALUE == 4) ||         \
     (STM32_CFG_PLLQ_VALUE == 6) || (STM32_CFG_PLLQ_VALUE == 8)) &&         \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLLQ_VALUE value specified"
#endif

/**
 * @brief   PLLQ clock register bits.
 */
#if (STM32_PLLQ_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLQ_BITS                   (RCC_PLLCFGR_PLLQEN |           \
                                             (((STM32_CFG_PLLQ_VALUE / 2U) - \
                                               1U) << RCC_PLLCFGR_PLLQ_Pos))
#else
  #define STM32_PLLQ_BITS                   0U
#endif

/**
 * @brief   PLL Q output clock point.
 */
#if (STM32_PLLQ_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLQ_FREQ                   (STM32_PLLVCO_FREQ /            \
                                             STM32_CFG_PLLQ_VALUE)
#else
  #define STM32_PLLQ_FREQ                   0U
#endif
#define STM32_PLLQ_CLOCK                    hal_lld_get_clock_point(CLK_PLLQ)

#if !((STM32_PLLQ_ENABLED != TRUE) || (STM32_PLLQ_FREQ >= STM32_PLLQ_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLQ_FREQ below minimum frequency"
#endif

#if !((STM32_PLLQ_ENABLED != TRUE) || (STM32_PLLQ_FREQ <= STM32_PLLQ_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLQ_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLLR clock point. -------------------------*/

#if !((STM32_CFG_PLLR_VALUE == 2) || (STM32_CFG_PLLR_VALUE == 4) ||         \
     (STM32_CFG_PLLR_VALUE == 6) || (STM32_CFG_PLLR_VALUE == 8)) &&         \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLLR_VALUE value specified"
#endif

/**
 * @brief   PLLR clock register bits.
 */
#if (STM32_PLLR_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLR_BITS                   (RCC_PLLCFGR_PLLREN |           \
                                             (((STM32_CFG_PLLR_VALUE / 2U) - \
                                               1U) << RCC_PLLCFGR_PLLR_Pos))
#else
  #define STM32_PLLR_BITS                   0U
#endif

/**
 * @brief   PLL R output clock point.
 */
#if (STM32_PLLR_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLLR_FREQ                   (STM32_PLLVCO_FREQ /            \
                                             STM32_CFG_PLLR_VALUE)
#else
  #define STM32_PLLR_FREQ                   0U
#endif
#define STM32_PLLR_CLOCK                    hal_lld_get_clock_point(CLK_PLLR)

#if !((STM32_PLLR_ENABLED != TRUE) || (STM32_PLLR_FREQ >= STM32_PLLR_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLR_FREQ below minimum frequency"
#endif

#if !((STM32_PLLR_ENABLED != TRUE) || (STM32_PLLR_FREQ <= STM32_PLLR_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLLR_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the SYSCLK clock point. -----------------------*/

/**
 * @brief   SYSCLK clock register bits.
 */
#if (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSI) || defined(__DOXYGEN__)
  #define STM32_SYSCLK_BITS                 RCC_CFGR_SW_HSI
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSE)
  #define STM32_SYSCLK_BITS                 RCC_CFGR_SW_HSE
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_PLL)
  #define STM32_SYSCLK_BITS                 RCC_CFGR_SW_PLL
#else
  #error "invalid STM32_CFG_SYSCLK_SEL value specified"
#endif

/**
 * @brief   System clock point.
 */
#if ((STM32_SYSCLK_ENABLED == TRUE) && \
     (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSI)) || \
    defined(__DOXYGEN__)
  #define STM32_SYSCLK_FREQ                 STM32_HSI16_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSE)
  #define STM32_SYSCLK_FREQ                 STM32_HSE_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_PLL)
  #define STM32_SYSCLK_FREQ                 STM32_PLLR_FREQ
#else
  #define STM32_SYSCLK_FREQ                 0U
#endif
#define STM32_SYSCLK_CLOCK                  hal_lld_get_clock_point(CLK_SYSCLK)

#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSI)) ||                         \
     (STM32_HSI16_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSE)) ||                         \
     (STM32_HSE_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

