emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
#if !defined(RCC_CFGR_SW_PLL) && !defined(__DOXYGEN__)
  #error "RCC_CFGR_SW_PLL not defined"
#endif
#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_PLL)) ||                         \
     (STM32_PLLR_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the HCLK clock point. -------------------------*/

/**
 * @brief   HCLK clock register bits.
 */
#if (STM32_CFG_HCLK_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV1
#elif (STM32_CFG_HCLK_VALUE == 2)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV2
#elif (STM32_CFG_HCLK_VALUE == 4)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV4
#elif (STM32_CFG_HCLK_VALUE == 8)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV8
#elif (STM32_CFG_HCLK_VALUE == 16)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV16
#elif (STM32_CFG_HCLK_VALUE == 64)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV64
#elif (STM32_CFG_HCLK_VALUE == 128)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV128
#elif (STM32_CFG_HCLK_VALUE == 256)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV256
#elif (STM32_CFG_HCLK_VALUE == 512)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV512
#else
  #error "invalid STM32_CFG_HCLK_VALUE value specified"
#endif

/**
 * @brief   AHB clock point.
 */
#define STM32_HCLK_FREQ                     (STM32_SYSCLK_FREQ /            \
                                             STM32_CFG_HCLK_VALUE)
#define STM32_HCLK_CLOCK                    hal_lld_get_clock_point(CLK_HCLK)

#if !((STM32_HCLK_ENABLED != TRUE) || (STM32_HCLK_FREQ <= STM32_HCLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HCLK_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PCLK1 clock point. ------------------------*/

/**
 * @brief   PCLK1 clock register bits.
 */
#if (STM32_CFG_PCLK1_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV1
#elif (STM32_CFG_PCLK1_VALUE == 2)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV2
#elif (STM32_CFG_PCLK1_VALUE == 4)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV4
#elif (STM32_CFG_PCLK1_VALUE == 8)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV8
#elif (STM32_CFG_PCLK1_VALUE == 16)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV16
#else
  #error "invalid STM32_CFG_PCLK1_VALUE value specified"
#endif

/**
 * @brief   APB1 clock point.
 */
#define STM32_PCLK1_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK1_VALUE)
#define STM32_PCLK1_CLOCK                   hal_lld_get_clock_point(CLK_PCLK1)

#if !((STM32_PCLK1_ENABLED != TRUE) || (STM32_PCLK1_FREQ <= STM32_PCLK1_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK1_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PCLK2 clock point. ------------------------*/

/**
 * @brief   PCLK2 clock register bits.
 */
#if (STM32_CFG_PCLK2_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV1
#elif (STM32_CFG_PCLK2_VALUE == 2)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV2
#elif (STM32_CFG_PCLK2_VALUE == 4)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV4
#elif (STM32_CFG_PCLK2_VALUE == 8)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV8
#elif (STM32_CFG_PCLK2_VALUE == 16)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV16
#else
  #error "invalid STM32_CFG_PCLK2_VALUE value specified"
#endif

/**
 * @brief   APB2 clock point.
 */
#define STM32_PCLK2_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK2_VALUE)
#define STM32_PCLK2_CLOCK                   hal_lld_get_clock_point(CLK_PCLK2)

#if !((STM32_PCLK2_ENABLED != TRUE) || (STM32_PCLK2_FREQ <= STM32_PCLK2_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK2_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PCLK1TIM clock point. ---------------------*/

/**
 * @brief   PCLK1TIM clock register bits.
 */
#define STM32_PCLK1TIM_BITS                 0U

/**
 * @brief   APB1 timer clock point.
 */
#define STM32_PCLK1TIM_FREQ                 ((STM32_CFG_PCLK1_VALUE == 1) ? STM32_PCLK1_FREQ : \
                                             (STM32_PCLK1_FREQ * 2U))
#define STM32_PCLK1TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK1TIM)

/* --- Macros and checks for the PCLK2TIM clock point. ---------------------*/

/**
 * @brief   PCLK2TIM clock register bits.
 */
#define STM32_PCLK2TIM_BITS                 0U

/**
 * @brief   APB2 timer clock point.
 */
#define STM32_PCLK2TIM_FREQ                 ((STM32_CFG_PCLK2_VALUE == 1) ? STM32_PCLK2_FREQ : \
                                             (STM32_PCLK2_FREQ * 2U))
#define STM32_PCLK2TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK2TIM)

/* --- Macros and checks for the HSEDIV clock point. -----------------------*/

/**
 * @brief   HSEDIV clock register bits.
 */
#define STM32_HSEDIV_BITS                   0U

/**
 * @brief   HSE divided-by-32 RTC clock point.
 */
#if (STM32_HSEDIV_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSEDIV_FREQ                 (STM32_HSE_FREQ / 32U)
  #define STM32_HSEDIV_CLOCK                (STM32_HSE_CLOCK / 32U)
#else
  #define STM32_HSEDIV_FREQ                 0U
  #define STM32_HSEDIV_CLOCK                0U
#endif

/* --- Macros and checks for the MCODIV clock point. -----------------------*/

/**
 * @brief   MCODIV clock register bits.
 */
#if (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_NOCLOCK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_SYSCLK)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_SYSCLK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI16)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSI16
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_PLLRCLK)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_PLLRCLK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSI)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_LSI
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_LSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI48)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSI48
#else
  #error "invalid STM32_CFG_MCODIV_SEL value specified"
#endif

/**
 * @brief   MCO source before prescaler clock point.
 */
#if ((STM32_MCODIV_ENABLED == TRUE) && \
     (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_MCODIV_FREQ                 STM32_NONE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_NONE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_SYSCLK)
  #define STM32_MCODIV_FREQ                 STM32_SYSCLK_FREQ
  #define STM32_MCODIV_CLOCK                STM32_SYSCLK_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI16)
  #define STM32_MCODIV_FREQ                 STM32_HSI16_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSE)
  #define STM32_MCODIV_FREQ                 STM32_HSE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_PLLRCLK)
  #define STM32_MCODIV_FREQ                 STM32_PLLR_FREQ
  #define STM32_MCODIV_CLOCK                STM32_PLLR_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSI)
  #define STM32_MCODIV_FREQ                 STM32_LSI_FREQ
  #define STM32_MCODIV_CLOCK                STM32_LSI_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSE)
  #define STM32_MCODIV_FREQ                 STM32_LSE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_LSE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI48)
  #define STM32_MCODIV_FREQ                 STM32_HSI48_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSI48_CLOCK
#else
  #define STM32_MCODIV_FREQ                 0U
  #define STM32_MCODIV_CLOCK                0U
#endif

