emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
/* --- Macros and checks for the MCO clock point. --------------------------*/

/**
 * @brief   MCO clock register bits.
 */
#if (STM32_CFG_MCO_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV1
#elif (STM32_CFG_MCO_VALUE == 2)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV2
#elif (STM32_CFG_MCO_VALUE == 4)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV4
#elif (STM32_CFG_MCO_VALUE == 8)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV8
#elif (STM32_CFG_MCO_VALUE == 16)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV16
#else
  #error "invalid STM32_CFG_MCO_VALUE value specified"
#endif

/**
 * @brief   MCO output pin clock point.
 */
#define STM32_MCO_FREQ                      (STM32_MCODIV_FREQ /            \
                                             STM32_CFG_MCO_VALUE)
#define STM32_MCO_CLOCK                     hal_lld_get_clock_point(CLK_MCO)

/* --- Macros and checks for the LSCO clock point. -------------------------*/

/**
 * @brief   LSCO clock register bits.
 */
#if (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_NOCLOCK
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSI
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSE
#else
  #error "invalid STM32_CFG_LSCO_SEL value specified"
#endif

/**
 * @brief   LSCO output pin clock point.
 */
#if ((STM32_LSCO_ENABLED == TRUE) && \
     (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_LSCO_FREQ                   STM32_NONE_FREQ
  #define STM32_LSCO_CLOCK                  STM32_NONE_CLOCK
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_FREQ                   STM32_LSI_FREQ
  #define STM32_LSCO_CLOCK                  STM32_LSI_CLOCK
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_FREQ                   STM32_LSE_FREQ
  #define STM32_LSCO_CLOCK                  STM32_LSE_CLOCK
#else
  #define STM32_LSCO_FREQ                   0U
  #define STM32_LSCO_CLOCK                  0U
#endif

/* --- Macros and checks for the RTC clock point. --------------------------*/

/**
 * @brief   RTC clock register bits.
 */
#if (STM32_RTC_ENABLED == FALSE)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_NOCLOCK
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_NOCLOCK
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_LSE
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_LSI
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_HSEDIV
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#else
  #error "invalid STM32_CFG_RTC_SEL value specified"
#endif

/**
 * @brief   RTC clock point.
 */
#if ((STM32_RTC_ENABLED == TRUE) && \
     (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_RTC_FREQ                    STM32_NONE_FREQ
  #define STM32_RTC_CLOCK                   STM32_NONE_CLOCK
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #define STM32_RTC_FREQ                    STM32_LSE_FREQ
  #define STM32_RTC_CLOCK                   STM32_LSE_CLOCK
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #define STM32_RTC_FREQ                    STM32_LSI_FREQ
  #define STM32_RTC_CLOCK                   STM32_LSI_CLOCK
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #define STM32_RTC_FREQ                    STM32_HSEDIV_FREQ
  #define STM32_RTC_CLOCK                   STM32_HSEDIV_CLOCK
#else
  #define STM32_RTC_FREQ                    0U
  #define STM32_RTC_CLOCK                   0U
#endif

/* --- Macros and checks for the USART1 clock point. -----------------------*/

/**
 * @brief   USART1 clock register bits.
 */
#if (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #if (STM32_USART1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USART1_BITS               RCC_CCIPR_USART1SEL_PCLK2
  #else
    #define STM32_USART1_BITS               0U
  #endif
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_SYSCLK)
  #if (STM32_USART1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USART1_BITS               RCC_CCIPR_USART1SEL_SYSCLK
  #else
    #define STM32_USART1_BITS               0U
  #endif
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_HSI16)
  #if (STM32_USART1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USART1_BITS               RCC_CCIPR_USART1SEL_HSI16
  #else
    #define STM32_USART1_BITS               0U
  #endif
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_LSE)
  #if (STM32_USART1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USART1_BITS               RCC_CCIPR_USART1SEL_LSE
  #else
    #define STM32_USART1_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_USART1_SEL value specified"
#endif

/**
 * @brief   USART1 clock point.
 */
#if ((STM32_USART1_ENABLED == TRUE) && \
     (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_PCLK2)) || \
    defined(__DOXYGEN__)
  #define STM32_USART1_FREQ                 STM32_PCLK2_FREQ
  #define STM32_USART1_CLOCK                STM32_PCLK2_CLOCK
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_SYSCLK)
  #define STM32_USART1_FREQ                 STM32_SYSCLK_FREQ
  #define STM32_USART1_CLOCK                STM32_SYSCLK_CLOCK
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_HSI16)
  #define STM32_USART1_FREQ                 STM32_HSI16_FREQ
  #define STM32_USART1_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_LSE)
  #define STM32_USART1_FREQ                 STM32_LSE_FREQ
  #define STM32_USART1_CLOCK                STM32_LSE_CLOCK
#else
  #define STM32_USART1_FREQ                 0U
  #define STM32_USART1_CLOCK                0U
#endif

