emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
/* --- Macros and checks for the I2S23 clock point. ------------------------*/

/**
 * @brief   I2S23 clock register bits.
 */
#if (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_SYSCLK) || defined(__DOXYGEN__)
  #if (STM32_I2S23_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2S23_BITS                RCC_CCIPR_I2S23SEL_SYSCLK
  #else
    #define STM32_I2S23_BITS                0U
  #endif
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_PLLQCLK)
  #if (STM32_I2S23_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2S23_BITS                RCC_CCIPR_I2S23SEL_PLLQCLK
  #else
    #define STM32_I2S23_BITS                0U
  #endif
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_CKIN)
  #if (STM32_I2S23_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2S23_BITS                RCC_CCIPR_I2S23SEL_CKIN
  #else
    #define STM32_I2S23_BITS                0U
  #endif
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_HSI16)
  #if (STM32_I2S23_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2S23_BITS                RCC_CCIPR_I2S23SEL_HSI16
  #else
    #define STM32_I2S23_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_I2S23_SEL value specified"
#endif

/**
 * @brief   I2S23 clock point.
 */
#if ((STM32_I2S23_ENABLED == TRUE) && \
     (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_I2S23_FREQ                  STM32_SYSCLK_FREQ
  #define STM32_I2S23_CLOCK                 STM32_SYSCLK_CLOCK
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_PLLQCLK)
  #define STM32_I2S23_FREQ                  STM32_PLLQ_FREQ
  #define STM32_I2S23_CLOCK                 STM32_PLLQ_CLOCK
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_CKIN)
  #define STM32_I2S23_FREQ                  STM32_CKIN_FREQ
  #define STM32_I2S23_CLOCK                 STM32_CKIN_CLOCK
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_HSI16)
  #define STM32_I2S23_FREQ                  STM32_HSI16_FREQ
  #define STM32_I2S23_CLOCK                 STM32_HSI16_CLOCK
#else
  #define STM32_I2S23_FREQ                  0U
  #define STM32_I2S23_CLOCK                 0U
#endif

/* --- Macros and checks for the FDCAN clock point. ------------------------*/

/**
 * @brief   FDCAN clock register bits.
 */
#if (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_HSE) || defined(__DOXYGEN__)
  #if (STM32_FDCAN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN_BITS                RCC_CCIPR_FDCANSEL_HSE
  #else
    #define STM32_FDCAN_BITS                0U
  #endif
#elif (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PLLQCLK)
  #if (STM32_FDCAN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN_BITS                RCC_CCIPR_FDCANSEL_PLLQCLK
  #else
    #define STM32_FDCAN_BITS                0U
  #endif
#elif (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PCLK1)
  #if (STM32_FDCAN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN_BITS                RCC_CCIPR_FDCANSEL_PCLK1
  #else
    #define STM32_FDCAN_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_FDCAN_SEL value specified"
#endif

/**
 * @brief   FDCAN clock point.
 */
#if ((STM32_FDCAN_ENABLED == TRUE) && \
     (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_HSE)) || \
    defined(__DOXYGEN__)
  #define STM32_FDCAN_FREQ                  STM32_HSE_FREQ
  #define STM32_FDCAN_CLOCK                 STM32_HSE_CLOCK
#elif (STM32_FDCAN_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PLLQCLK)
  #define STM32_FDCAN_FREQ                  STM32_PLLQ_FREQ
  #define STM32_FDCAN_CLOCK                 STM32_PLLQ_CLOCK
#elif (STM32_FDCAN_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PCLK1)
  #define STM32_FDCAN_FREQ                  STM32_PCLK1_FREQ
  #define STM32_FDCAN_CLOCK                 STM32_PCLK1_CLOCK
#else
  #define STM32_FDCAN_FREQ                  0U
  #define STM32_FDCAN_CLOCK                 0U
#endif

/* --- Macros and checks for the CLK48 clock point. ------------------------*/

/**
 * @brief   CLK48 clock register bits.
 */
#if (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_CLK48_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_CLK48_BITS                RCC_CCIPR_CLK48SEL_HSI48
  #else
    #define STM32_CLK48_BITS                0U
  #endif
#elif (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_PLLQCLK)
  #if (STM32_CLK48_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_CLK48_BITS                RCC_CCIPR_CLK48SEL_PLLQCLK
  #else
    #define STM32_CLK48_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_CLK48_SEL value specified"
#endif

/**
 * @brief   48MHz clock point.
 */
#if ((STM32_CLK48_ENABLED == TRUE) && \
     (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_CLK48_FREQ                  STM32_HSI48_FREQ
  #define STM32_CLK48_CLOCK                 STM32_HSI48_CLOCK
#elif (STM32_CLK48_ENABLED == TRUE) && \
      (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_PLLQCLK)
  #define STM32_CLK48_FREQ                  STM32_PLLQ_FREQ
  #define STM32_CLK48_CLOCK                 STM32_PLLQ_CLOCK
#else
  #define STM32_CLK48_FREQ                  0U
  #define STM32_CLK48_CLOCK                 0U
#endif

/* --- Macros and checks for the ADC12 clock point. ------------------------*/

/**
 * @brief   ADC12 clock register bits.
 */
#if (STM32_ADC12_ENABLED == FALSE)
  #define STM32_ADC12_BITS                  RCC_CCIPR_ADC12SEL_NOCLK
#elif (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_NOCLK) || defined(__DOXYGEN__)
  #if (STM32_ADC12_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC12_BITS                RCC_CCIPR_ADC12SEL_NOCLK
  #else
    #define STM32_ADC12_BITS                0U
  #endif
#elif (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)
  #if (STM32_ADC12_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC12_BITS                RCC_CCIPR_ADC12SEL_PLLPCLK
  #else
    #define STM32_ADC12_BITS                0U
  #endif
#elif (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)
  #if (STM32_ADC12_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC12_BITS                RCC_CCIPR_ADC12SEL_SYSCLK
  #else
    #define STM32_ADC12_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_ADC12_SEL value specified"
#endif

/**
 * @brief   ADC12 clock point.
 */
#if ((STM32_ADC12_ENABLED == TRUE) && \
     (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_NOCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADC12_FREQ                  STM32_NONE_FREQ
  #define STM32_ADC12_CLOCK                 STM32_NONE_CLOCK
#elif (STM32_ADC12_ENABLED == TRUE) && \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)
  #define STM32_ADC12_FREQ                  STM32_PLLP_FREQ
  #define STM32_ADC12_CLOCK                 STM32_PLLP_CLOCK
#elif (STM32_ADC12_ENABLED == TRUE) && \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)
  #define STM32_ADC12_FREQ                  STM32_SYSCLK_FREQ
  #define STM32_ADC12_CLOCK                 STM32_SYSCLK_CLOCK
#else
  #define STM32_ADC12_FREQ                  0U
  #define STM32_ADC12_CLOCK                 0U
#endif

#if !(!((STM32_ADC12_ENABLED == TRUE) &&                                    \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)) ||               \
     (STM32_PLLP_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC12_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADC12_ENABLED == TRUE) &&                                    \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)) ||                \
     (STM32_SYSCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC12_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the ADC345 clock point. -----------------------*/

/**
 * @brief   ADC345 clock register bits.
 */
#if (STM32_ADC345_ENABLED == FALSE)
  #define STM32_ADC345_BITS                 RCC_CCIPR_ADC345SEL_NOCLK
#elif (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_NOCLK) ||                \
      defined(__DOXYGEN__)
  #if (STM32_ADC345_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC345_BITS               RCC_CCIPR_ADC345SEL_NOCLK
  #else
    #define STM32_ADC345_BITS               0U
  #endif
#elif (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)
  #if (STM32_ADC345_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC345_BITS               RCC_CCIPR_ADC345SEL_PLLPCLK
  #else
    #define STM32_ADC345_BITS               0U
  #endif
#elif (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)
  #if (STM32_ADC345_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADC345_BITS               RCC_CCIPR_ADC345SEL_SYSCLK
  #else
    #define STM32_ADC345_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_ADC345_SEL value specified"
#endif

/**
 * @brief   ADC345 clock point.
 */
#if ((STM32_ADC345_ENABLED == TRUE) && \
     (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_NOCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADC345_FREQ                 STM32_NONE_FREQ
  #define STM32_ADC345_CLOCK                STM32_NONE_CLOCK
#elif (STM32_ADC345_ENABLED == TRUE) && \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)
  #define STM32_ADC345_FREQ                 STM32_PLLP_FREQ
  #define STM32_ADC345_CLOCK                STM32_PLLP_CLOCK
#elif (STM32_ADC345_ENABLED == TRUE) && \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)
  #define STM32_ADC345_FREQ                 STM32_SYSCLK_FREQ
  #define STM32_ADC345_CLOCK                STM32_SYSCLK_CLOCK
#else
  #define STM32_ADC345_FREQ                 0U
  #define STM32_ADC345_CLOCK                0U
#endif

#if !(!((STM32_ADC345_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)) ||             \
     (STM32_PLLP_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC345_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADC345_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)) ||              \
     (STM32_SYSCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC345_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the QSPI clock point. -------------------------*/

/**
 * @brief   QSPI clock register bits.
 */
#if (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_SYSCLK) || defined(__DOXYGEN__)
  #if (STM32_QSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_QSPI_BITS                 RCC_CCIPR2_QSPISEL_SYSCLK
  #else
    #define STM32_QSPI_BITS                 0U
  #endif
#elif (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_HSI16)
  #if (STM32_QSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_QSPI_BITS                 RCC_CCIPR2_QSPISEL_HSI16
  #else
    #define STM32_QSPI_BITS                 0U
  #endif
#elif (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_PLLQCLK)
  #if (STM32_QSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_QSPI_BITS                 RCC_CCIPR2_QSPISEL_PLLQCLK
  #else
    #define STM32_QSPI_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_QSPI_SEL value specified"
#endif

/**
 * @brief   QSPI clock point.
 */
#if ((STM32_QSPI_ENABLED == TRUE) && \
     (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_QSPI_FREQ                   STM32_SYSCLK_FREQ
  #define STM32_QSPI_CLOCK                  STM32_SYSCLK_CLOCK
#elif (STM32_QSPI_ENABLED == TRUE) && \
      (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_HSI16)
  #define STM32_QSPI_FREQ                   STM32_HSI16_FREQ
  #define STM32_QSPI_CLOCK                  STM32_HSI16_CLOCK
#elif (STM32_QSPI_ENABLED == TRUE) && \
      (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_PLLQCLK)
  #define STM32_QSPI_FREQ                   STM32_PLLQ_FREQ
  #define STM32_QSPI_CLOCK                  STM32_PLLQ_CLOCK
#else
  #define STM32_QSPI_FREQ                   0U
  #define STM32_QSPI_CLOCK                  0U
#endif

/* --- Macros and checks for the RNG clock point. --------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#define STM32_RNG_BITS                      0U

/**
 * @brief   RNG clock point.
 */
#if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_RNG_FREQ                    STM32_CLK48_FREQ
  #define STM32_RNG_CLOCK                   STM32_CLK48_CLOCK
#else
  #define STM32_RNG_FREQ                    0U
  #define STM32_RNG_CLOCK                   0U
#endif

/* --- Macros and checks for the USB clock point. --------------------------*/

/**
 * @brief   USB clock register bits.
 */
#define STM32_USB_BITS                      0U

/**
 * @brief   USB clock point.
 */
#if (STM32_USB_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_USB_FREQ                    STM32_CLK48_FREQ
  #define STM32_USB_CLOCK                   STM32_CLK48_CLOCK
#else
  #define STM32_USB_FREQ                    0U
  #define STM32_USB_CLOCK                   0U
#endif

