emirhan-sonmez/chibios/os/xhal/ports/STM32/STM32G4xx/clocktree.h
/*
 * Sink-specific frequency checks.
 */
#if !(!(STM32_USB_DEMANDED == TRUE) || (STM32_USB_FREQ >= STM32_USBCLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ below minimum frequency for USB"
#endif

#if !(!(STM32_USB_DEMANDED == TRUE) || (STM32_USB_FREQ <= STM32_USBCLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ above maximum frequency for USB"
#endif
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                 \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                 \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                 \
   (clkpt) == CLK_PLLP         ? STM32_PLLP_FREQ          :                 \
   (clkpt) == CLK_PLLQ         ? STM32_PLLQ_FREQ          :                 \
   (clkpt) == CLK_PLLR         ? STM32_PLLR_FREQ          :                 \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                 \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                 \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                 \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                 \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                 \
   (clkpt) == CLK_MCO          ? STM32_MCO_FREQ           :                 \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
